_app/_posts/soft/2016-04-11-terminal使用proxychains代理.html
---
layout: post
title: Terminal无法代理的解决
date: 2016-04-11
categories: 
- soft
tags: 
- terminal
- proxychains
- 代理
- socks
- shadowsocks
author: yefeiyu
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">install proxychains-ng 4</h2>
<div class="outline-text-2" id="text-1">
<p>
通过git获取源码<br  />
git clone git@github.com:rofl0r/proxychains-ng.git<br  />
安装<br  />
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-0-1" name="sec-1-0-1"></a>Installation <b>*</b><br  /><div class="outline-text-4" id="text-1-0-1">
<div class="org-src-container">

<pre class="src src-lisp"># needs a working C compiler, preferably gcc
./configure --prefix=/usr --sysconfdir=/etc
make
[optional] sudo make install
[optional] sudo make install-config (installs proxychains.conf)

if you dont install, you can use proxychains from the build directory
like this: ./proxychains4 -f src/proxychains.conf telnet google.com 80
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">修改配置文件</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-lisp">emacs /etc/proxychains.conf
</pre>
</div>
<p>
添加socks5 127.0.0.1:1080<br  />
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">使用</h2>
<div class="outline-text-2" id="text-3">
<p>
将需要代理的命令行前输入proxychains4或sudo proxychains4走代理通道<br  />
</p>
</div>
</div>
